spec/fixtures/vcr_cassettes/refund_a_stripe_charge.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_14idw52L7z1ZOsnrb3cnglVa
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air-2.att.net 14.0.0 Darwin Kernel Version 14.0.0: Tue Sep 23 23:01:41
        PDT 2014; root:xnu-2782.1.97~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 02 Oct 2014 02:05:30 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1650'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - 7a030386-6547-45fa-8e98-d78af2230158
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_14idw52L7z1ZOsnrb3cnglVa",
          "object": "charge",
          "created": 1412134673,
          "livemode": false,
          "paid": true,
          "amount": 100,
          "currency": "usd",
          "refunded": true,
          "card": {
            "id": "card_14fIQG2L7z1ZOsnrLJ20V9AZ",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 10,
            "exp_year": 2019,
            "fingerprint": "YLXIMHjCTxjLsj9Z",
            "country": "US",
            "name": "Joseph Sak",
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null,
            "customer": "cus_4owBd56c0O71sU"
          },
          "captured": true,
          "refunds": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/charges/ch_14idw52L7z1ZOsnrb3cnglVa/refunds",
            "data": [
              {
                "id": "re_14iywu2L7z1ZOsnrt6FfjWQZ",
                "amount": 100,
                "currency": "usd",
                "created": 1412215448,
                "object": "refund",
                "balance_transaction": "txn_14iywu2L7z1ZOsnrXFe5A1kb",
                "metadata": {},
                "charge": "ch_14idw52L7z1ZOsnrb3cnglVa",
                "receipt_number": null
              }
            ]
          },
          "balance_transaction": "txn_14idw52L7z1ZOsnrYkHecNGF",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 100,
          "customer": "cus_4owBd56c0O71sU",
          "invoice": null,
          "description": "Charge for joe2@joesak.com booking Joe is cool",
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "receipt_email": null,
          "receipt_number": null
        }
    http_version: 
  recorded_at: Thu, 02 Oct 2014 02:05:31 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges/ch_14idw52L7z1ZOsnrb3cnglVa/refunds
    body:
      encoding: ASCII-8BIT
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air-2.att.net 14.0.0 Darwin Kernel Version 14.0.0: Tue Sep 23 23:01:41
        PDT 2014; root:xnu-2782.1.97~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '0'
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Thu, 02 Oct 2014 02:05:31 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '137'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "type": "invalid_request_error",
            "message": "Charge ch_14idw52L7z1ZOsnrb3cnglVa has already been refunded."
          }
        }
    http_version: 
  recorded_at: Thu, 02 Oct 2014 02:05:31 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_14idZB2L7z1ZOsnrWNam4P1n
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air-2.att.net 14.0.0 Darwin Kernel Version 14.0.0: Tue Sep 23 23:01:41
        PDT 2014; root:xnu-2782.1.97~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 02 Oct 2014 02:06:11 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1307'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - e8b84beb-8943-4be3-b6fd-eba68cb6f3ee
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_14idZB2L7z1ZOsnrWNam4P1n",
          "object": "charge",
          "created": 1412133253,
          "livemode": false,
          "paid": true,
          "amount": 100,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_14fIQG2L7z1ZOsnrLJ20V9AZ",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 10,
            "exp_year": 2019,
            "fingerprint": "YLXIMHjCTxjLsj9Z",
            "country": "US",
            "name": "Joseph Sak",
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null,
            "customer": "cus_4owBd56c0O71sU"
          },
          "captured": true,
          "refunds": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/charges/ch_14idZB2L7z1ZOsnrWNam4P1n/refunds",
            "data": []
          },
          "balance_transaction": "txn_14idZB2L7z1ZOsnrgvYXaNkQ",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_4owBd56c0O71sU",
          "invoice": null,
          "description": "Charge for joe2@joesak.com booking Joe is cool",
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "receipt_email": null,
          "receipt_number": null
        }
    http_version: 
  recorded_at: Thu, 02 Oct 2014 02:06:11 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges/ch_14idZB2L7z1ZOsnrWNam4P1n/refunds
    body:
      encoding: ASCII-8BIT
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air-2.att.net 14.0.0 Darwin Kernel Version 14.0.0: Tue Sep 23 23:01:41
        PDT 2014; root:xnu-2782.1.97~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '0'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 02 Oct 2014 02:06:11 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '271'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - f2afe0b8-a184-4bbe-b921-2c313594713f
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "re_14iyyu2L7z1ZOsnrHn4KzB4r",
          "amount": 100,
          "currency": "usd",
          "created": 1412215572,
          "object": "refund",
          "balance_transaction": "txn_14iyyu2L7z1ZOsnrLPY1K4TO",
          "metadata": {},
          "charge": "ch_14idZB2L7z1ZOsnrWNam4P1n",
          "receipt_number": null
        }
    http_version: 
  recorded_at: Thu, 02 Oct 2014 02:06:12 GMT
recorded_with: VCR 2.9.3
